src/Cases/buoyantBoussinesqPimple/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue qPlant 0
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (2000 1000 20);
        fieldValues
        (
            volScalarFieldValue Cd 0.2
            volScalarFieldValue LAD 0.25
        );
    }
    
    boxToCell
    {
        box (3000 0 0) (4000 1000 20);
        fieldValues
        (
            volScalarFieldValue Cd 0.2
            volScalarFieldValue LAD 0.25
        );
    }
    
        boxToCell
    {
        box (6000 0 0) (9000 1000 20);
        fieldValues
        (
            volScalarFieldValue Cd 0.2
            volScalarFieldValue LAD 0.25
        );
    }

    patchToFace
    {
        patch                    bottom;
        fieldValues
        (
            volScalarFieldValue Cd 0.2
            volScalarFieldValue LAD 0.1
        );
    }
);


// ************************************************************************* //
