src/Cases/buoyantBoussinesqPimple/system/turbulenceFields
// -*- C++ -*-

type            turbulenceFields;
libs            (fieldFunctionObjects);
field           R;
writeControl    writeTime;


// *********************************************************************** //
